/*
target length বড় এবং প্রতিটা নাম্বার ও বেশ বড় তাই পুরা প্রসেস সিমুলেট করা যাবে না। 
এই মেথড টা অনেকটা গ্রিডি এপ্রোচ এর মতো। আমরা চেষ্ট করবো একটা অপারেশন এর মাধ্যমে যত বেশী সংখ্যক এলিমেন্টকে ইনক্রিজ করা যায়। কোন নাম্বার যদি প্রিভিয়াস নাম্বার থেকে ছোট (curr < prev) হয় তাহলে একই একটা মুভের মাধ্যমেই কারেন্ট নাম্বারকেও ইনক্রিজ করা যাবে। তারমানে মুভের সংখ্যা বাড়বে না,কিন্তু এটা বটলনেকের মত কাজ করবে। ধরা যাক আগে ১০ ছিলো তারমানে আগে ১০টা মুভ লাগতো কিন্তু কারেন্ট নাম্বার ৩, বটলনেকের কারনে ৩টা মুভ ভবিষ্যতে Re-use করা যাবে। ১০টা মুভ দিয়ে কারেন্ট নাম্বার ও টার্গেট পর্যন্ত নেওয়া যাবে , কিন্তু বটলনেকের কারনে ৩ টা মুভ পরবর্তি এলিমেন্টে প্রোপাগেট হবে। এরপর কোণ নাম্বার যদি আগের নাম্বার এর চাইতে বড় (curr > prev) হয় তাহলে বটলনেকের মুভ Re-use করতে পারবো এবং এডিশনাল curr - prev মুভ লাগবে।  
*/
class Solution {
public:
    int minNumberOperations(vector<int>& target) {
        int ans = 0 , prev = 0 , curr , n = target.size();
        for(int i = 0 ; i < n ; i++){
            curr = target[i];
            if(curr > prev)  
                ans += curr - prev;
            prev = curr;
        }
        return ans;
    }
};